svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_gpio.hpp
#ifndef __stm32f1xx_gpio_hpp__
#define __stm32f1xx_gpio_hpp__

#ifndef __cplusplus
# error "This file must be included to the C++ progect"
#endif /*__cplusplus*/

//////////////////////////////////////////////////////////////////////////
#include <stdint.h>
#include <stdbool.h>
#include <static_assert.hpp>

#include <gpio.hpp>

//////////////////////////////////////////////////////////////////////////
#include <stm32f1xx.h>
#include <stm32f1xx_registers.hpp>


/************************************************************************/
/*                                                                      */
/************************************************************************/
namespace mcu {

/************************************************************************/
/*                                                                      */
/************************************************************************/
#if defined(GPIOA_BASE)
#	define IF_GPIOA_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOA_BASE)*/
#	define IF_GPIOA_EXISTS(...)			
#endif /*defined(GPIOA_BASE)*/

#if defined(GPIOB_BASE)
#	define IF_GPIOB_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOB_BASE)*/
#	define IF_GPIOB_EXISTS(...)			
#endif /*defined(GPIOB_BASE)*/

#if defined(GPIOC_BASE)
#	define IF_GPIOC_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOC_BASE)*/
#	define IF_GPIOC_EXISTS(...)			
#endif /*defined(GPIOC_BASE)*/

#if defined(GPIOD_BASE)
#	define IF_GPIOD_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOD_BASE)*/
#	define IF_GPIOD_EXISTS(...)			
#endif /*defined(GPIOD_BASE)*/

#if defined(GPIOE_BASE)
#	define IF_GPIOE_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOE_BASE)*/
#	define IF_GPIOE_EXISTS(...)			
#endif /*defined(GPIOE_BASE)*/

#if defined(GPIOF_BASE)
#	define IF_GPIOF_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOF_BASE)*/
#	define IF_GPIOF_EXISTS(...)			
#endif /*defined(GPIOF_BASE)*/

#if defined(GPIOG_BASE)
#	define IF_GPIOG_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOG_BASE)*/
#	define IF_GPIOG_EXISTS(...)			
#endif /*defined(GPIOG_BASE)*/

#if defined(GPIOH_BASE)
#	define IF_GPIOH_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOH_BASE)*/
#	define IF_GPIOH_EXISTS(...)			
#endif /*defined(GPIOH_BASE)*/

#if defined(GPIOI_BASE)
#	define IF_GPIOI_EXISTS(...)			__VA_ARGS__
#else /*defined(GPIOI_BASE)*/
#	define IF_GPIOI_EXISTS(...)			
#endif /*defined(GPIOI_BASE)*/

/************************************************************************/
/*                                                                      */
/************************************************************************/
namespace stm32 {
namespace port {
	//////////////////////////////////////////////////////////////////////////
	typedef enum
	{
		inv_address = 0,
		
		IF_GPIOA_EXISTS(A = GPIOA_BASE,)
		IF_GPIOB_EXISTS(B = GPIOB_BASE,)
		IF_GPIOC_EXISTS(C = GPIOC_BASE,)
		IF_GPIOD_EXISTS(D = GPIOD_BASE,)
		IF_GPIOE_EXISTS(E = GPIOE_BASE,)
		IF_GPIOF_EXISTS(F = GPIOF_BASE,)
		IF_GPIOG_EXISTS(G = GPIOG_BASE,)
		IF_GPIOH_EXISTS(H = GPIOH_BASE,)
		IF_GPIOI_EXISTS(I = GPIOI_BASE,)
	} address;

	typedef enum
	{
		inv_pin = 255,
		
		pin_0   = 0,
		pin_1,
		pin_2,
		pin_3,
		pin_4,
		pin_5,
		pin_6,
		pin_7,
		pin_8,
		pin_9,
		pin_10,
		pin_11,
		pin_12,
		pin_13,
		pin_14,
		pin_15,
	} pin;
	
	using namespace ::mcu::gpio;
	
	template<pin_id::pin_id PinID>
	class convert
	{
	public:
		static const address to_address =
			IF_GPIOA_EXISTS((PinID >= pin_id::PA0 && PinID <= pin_id::PA15) ? A :)
			IF_GPIOB_EXISTS((PinID >= pin_id::PB0 && PinID <= pin_id::PB15) ? B :)
			IF_GPIOC_EXISTS((PinID >= pin_id::PC0 && PinID <= pin_id::PC15) ? C :)
			IF_GPIOD_EXISTS((PinID >= pin_id::PD0 && PinID <= pin_id::PD15) ? D :)
			IF_GPIOE_EXISTS((PinID >= pin_id::PE0 && PinID <= pin_id::PE15) ? E :)
			IF_GPIOF_EXISTS((PinID >= pin_id::PF0 && PinID <= pin_id::PF15) ? F :)
			IF_GPIOG_EXISTS((PinID >= pin_id::PG0 && PinID <= pin_id::PG15) ? G :)
			IF_GPIOH_EXISTS((PinID >= pin_id::PH0 && PinID <= pin_id::PH15) ? H :)
			IF_GPIOI_EXISTS((PinID >= pin_id::PI0 && PinID <= pin_id::PI15) ? I :)
			inv_address;

		static const pin to_pin =
			IF_GPIOA_EXISTS((PinID >= pin_id::PA0 && PinID <= pin_id::PA15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOB_EXISTS((PinID >= pin_id::PB0 && PinID <= pin_id::PB15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOC_EXISTS((PinID >= pin_id::PC0 && PinID <= pin_id::PC15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOD_EXISTS((PinID >= pin_id::PD0 && PinID <= pin_id::PD15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOE_EXISTS((PinID >= pin_id::PE0 && PinID <= pin_id::PE15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOF_EXISTS((PinID >= pin_id::PF0 && PinID <= pin_id::PF15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOG_EXISTS((PinID >= pin_id::PG0 && PinID <= pin_id::PG15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOH_EXISTS((PinID >= pin_id::PH0 && PinID <= pin_id::PH15) ? static_cast<pin>(PinID % 32) :)
			IF_GPIOI_EXISTS((PinID >= pin_id::PI0 && PinID <= pin_id::PI15) ? static_cast<pin>(PinID % 32) :)
			inv_pin;
	};
} // namespace port

namespace registers {
	//////////////////////////////////////////////////////////////////////////
	using namespace ::mcu::gpio;
	
	//////////////////////////////////////////////////////////////////////////
	class _const_
	{
	public:
		typedef enum {
			/* Definitions for bit manipulation of CRL and CRH registers */
			GPIO_CR_MODE_INPUT         = ((uint32_t)0x0 << 0),			/*!< 00: Input mode (reset state)              */
			GPIO_CR_MODE_OUTPUT_10MHZ  = ((uint32_t)0x1 << 0),			/*!< 01: Output mode, max speed 10 MHz         */
			GPIO_CR_MODE_OUTPUT_02MHZ  = ((uint32_t)0x2 << 0),			/*!< 10: Output mode, max speed  2 MHz         */
			GPIO_CR_MODE_OUTPUT_50MHZ  = ((uint32_t)0x3 << 0),			/*!< 11: Output mode, max speed 50 MHz         */
			GPIO_CR_CNF_ANALOG         = ((uint32_t)0x0 << 2),			/*!< 00: Analog mode                           */
			GPIO_CR_CNF_INPUT_FLOATING = ((uint32_t)0x1 << 2),			/*!< 01: Floating input (reset state)          */
			GPIO_CR_CNF_INPUT_PU_PD    = ((uint32_t)0x2 << 2),			/*!< 10: Input with pull-up / pull-down        */
			GPIO_CR_CNF_GP_OUTPUT_PP   = ((uint32_t)0x0 << 2),			/*!< 00: General purpose output push-pull      */
			GPIO_CR_CNF_GP_OUTPUT_OD   = ((uint32_t)0x1 << 2),			/*!< 01: General purpose output Open-drain     */
			GPIO_CR_CNF_AF_OUTPUT_PP   = ((uint32_t)0x2 << 2),			/*!< 10: Alternate function output Push-pull   */
			GPIO_CR_CNF_AF_OUTPUT_OD   = ((uint32_t)0x3 << 2),			/*!< 11: Alternate function output Open-drain  */
		} REG_GPIO_CR;
	};
	
	//////////////////////////////////////////////////////////////////////////
	template <
		mode::mode			Mode      ,
		speed::speed		Speed     ,
		state::state		DefState  ,
		pull::pull			Pull      ,
		flag::flag			Flag      ,
		port::address		Port      ,
		port::pin			Pin       
		>
	class REG_GPIO;
	
	//////////////////////////////////////////////////////////////////////////
	template <
		speed::speed		Speed     ,
		state::state		DefState  ,
		pull::pull			Pull      ,
		flag::flag			Flag      ,
		port::address		Port      ,
		port::pin			Pin       
		>
	class REG_GPIO<mode::analog, Speed, DefState, Pull, Flag, Port, Pin>
	{
		/* If we are configuring the pin in INPUT analog mode */
		static const uint32_t MODE = _const_::GPIO_CR_MODE_INPUT;
		static const uint32_t CNF  = _const_::GPIO_CR_CNF_ANALOG;
		
