svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_gpio.hpp
	public:
		static const uint32_t CR = MODE | CNF;
		static const uint32_t ODR_MASK  = 0;
		static const uint32_t ODR       = 0;
		static const uint32_t ODR_SET   = ODR;
		static const uint32_t ODR_RESET = ODR;
	};
	
	//////////////////////////////////////////////////////////////////////////
	template <
		speed::speed		Speed     ,
		state::state		DefState  ,
		pull::pull			Pull      ,
		flag::flag			Flag      ,
		port::address		Port      ,
		port::pin			Pin       
		>
	class REG_GPIO<mode::input, Speed, DefState, Pull, Flag, Port, Pin>
	{
		static const uint32_t pull_up_dn = ((Pull == pull::up) || (Pull == pull::down)) ? 0x01UL : 0x00UL;
		static const uint32_t MODE = _const_::GPIO_CR_MODE_INPUT;
		static const uint32_t CNF  = pull_up_dn ? _const_::GPIO_CR_CNF_INPUT_PU_PD : _const_::GPIO_CR_CNF_INPUT_FLOATING;

	public:
		static const uint32_t CR = MODE | CNF;
		static const uint32_t ODR_MASK  = (pull_up_dn << Pin);
		static const uint32_t ODR       = (Pull == pull::up) ? (0x01UL << Pin) : (0x00UL << Pin);
		static const uint32_t ODR_SET   = ODR;
		static const uint32_t ODR_RESET = ODR;
	};
	
	//////////////////////////////////////////////////////////////////////////
	template <
		speed::speed		Speed     ,
		state::state		DefState  ,
		pull::pull			Pull      ,
		flag::flag			Flag      ,
		port::address		Port      ,
		port::pin			Pin       
		>
	class REG_GPIO<mode::output, Speed, DefState, Pull, Flag, Port, Pin>
	{
	private:
		static const uint32_t MODE =
			(Speed == speed::low   ) ? _const_::GPIO_CR_MODE_OUTPUT_02MHZ :
			(Speed == speed::medium) ? _const_::GPIO_CR_MODE_OUTPUT_10MHZ :
			(Speed == speed::high  ) ? _const_::GPIO_CR_MODE_OUTPUT_50MHZ :
			                           _const_::GPIO_CR_MODE_OUTPUT_02MHZ;
		
		static const uint32_t CNF = 
			(Flag == flag::output_push_pull ) ? _const_::GPIO_CR_CNF_GP_OUTPUT_PP : /* If we are configuring the pin in OUTPUT push-pull mode */
			(Flag == flag::output_open_drain) ? _const_::GPIO_CR_CNF_GP_OUTPUT_OD : /* If we are configuring the pin in OUTPUT open-drain mode */
												  _const_::GPIO_CR_CNF_GP_OUTPUT_PP;

	public:
		static const uint32_t CR = MODE | CNF;
		static const uint32_t ODR_MASK  = (0x01UL << Pin);
		static const uint32_t ODR       = (DefState != state::reset) ? (0x01UL << Pin) : (0x00UL << Pin);
		static const uint32_t ODR_SET   = (0x01UL << Pin);	/* Set the corresponding ODR bit */
		static const uint32_t ODR_RESET = (0x00UL << Pin);	/* Reset the corresponding ODR bit */
	};
	
	//////////////////////////////////////////////////////////////////////////
	template <
		speed::speed		Speed     ,
		state::state		DefState  ,
		pull::pull			Pull      ,
		flag::flag			Flag      ,
		port::address		Port      ,
		port::pin			Pin       
		>
	class REG_GPIO<mode::alt_input, Speed, DefState, Pull, Flag, Port, Pin>
	{
		static const uint32_t pull_up_dn = ((Pull == pull::up) || (Pull == pull::down)) ? 0x01UL : 0x00UL;
		static const uint32_t MODE = _const_::GPIO_CR_MODE_INPUT;
		static const uint32_t CNF  = pull_up_dn ? _const_::GPIO_CR_CNF_INPUT_PU_PD : _const_::GPIO_CR_CNF_INPUT_FLOATING;

	public:
		static const uint32_t CR = MODE | CNF;
		static const uint32_t ODR_MASK  = (pull_up_dn << Pin);
		static const uint32_t ODR       = (Pull == pull::up) ? (0x01UL << Pin) : (0x00UL << Pin);
		static const uint32_t ODR_SET   = ODR;
		static const uint32_t ODR_RESET = ODR;
	};
	
	//////////////////////////////////////////////////////////////////////////
	template <
		speed::speed		Speed     ,
		state::state		DefState  ,
		pull::pull			Pull      ,
		flag::flag			Flag      ,
		port::address		Port      ,
		port::pin			Pin       
		>
	class REG_GPIO<mode::alt_output, Speed, DefState, Pull, Flag, Port, Pin>
	{
	private:
		static const uint32_t MODE =
			(Speed == speed::low   ) ? _const_::GPIO_CR_MODE_OUTPUT_02MHZ :
			(Speed == speed::medium) ? _const_::GPIO_CR_MODE_OUTPUT_10MHZ :
			(Speed == speed::high  ) ? _const_::GPIO_CR_MODE_OUTPUT_50MHZ :
			                           _const_::GPIO_CR_MODE_OUTPUT_02MHZ;
		
		static const uint32_t CNF = 
			(Flag == flag::output_push_pull ) ? _const_::GPIO_CR_CNF_AF_OUTPUT_PP : /* If we are configuring the pin in OUTPUT push-pull mode */
			(Flag == flag::output_open_drain) ? _const_::GPIO_CR_CNF_AF_OUTPUT_OD : /* If we are configuring the pin in OUTPUT open-drain mode */
												_const_::GPIO_CR_CNF_AF_OUTPUT_PP;

	public:
		static const uint32_t CR = MODE | CNF;
		static const uint32_t ODR_MASK  = 0;
		static const uint32_t ODR       = 0;
		static const uint32_t ODR_SET   = ODR;
		static const uint32_t ODR_RESET = ODR;
	};
	
	//////////////////////////////////////////////////////////////////////////
	template <
		mode::mode	Mode      ,
		pin_id::pin_id	PinID
		> class REG_RCC
	{
	public:
		static const uint32_t APB2ENR_AFIOEN = (Mode == mode::alt_input || Mode == mode::alt_output) ? RCC_APB2ENR_AFIOEN : 0;
		
		static const uint32_t APB2ENR_MASK = APB2ENR_AFIOEN | (
			IF_GPIOA_EXISTS((PinID >= pin_id::PA0 && PinID <= pin_id::PA31) ? RCC_APB2ENR_IOPAEN :)
			IF_GPIOB_EXISTS((PinID >= pin_id::PB0 && PinID <= pin_id::PB31) ? RCC_APB2ENR_IOPBEN :)
			IF_GPIOC_EXISTS((PinID >= pin_id::PC0 && PinID <= pin_id::PC31) ? RCC_APB2ENR_IOPCEN :)
			IF_GPIOD_EXISTS((PinID >= pin_id::PD0 && PinID <= pin_id::PD31) ? RCC_APB2ENR_IOPDEN :)
			IF_GPIOE_EXISTS((PinID >= pin_id::PE0 && PinID <= pin_id::PE31) ? RCC_APB2ENR_IOPEEN :)
			IF_GPIOF_EXISTS((PinID >= pin_id::PF0 && PinID <= pin_id::PF31) ? RCC_APB2ENR_IOPFEN :)
			IF_GPIOG_EXISTS((PinID >= pin_id::PG0 && PinID <= pin_id::PG31) ? RCC_APB2ENR_IOPGEN :)
			IF_GPIOH_EXISTS((PinID >= pin_id::PH0 && PinID <= pin_id::PH31) ? RCC_APB2ENR_IOPHEN :)
			IF_GPIOI_EXISTS((PinID >= pin_id::PI0 && PinID <= pin_id::PI31) ? RCC_APB2ENR_IOPIEN :)
			0);
		static const uint32_t APB2ENR = APB2ENR_MASK;
	};

} // namespace registers
} // namespace stm32

/************************************************************************/
/*                                                                      */
/************************************************************************/
namespace gpio {
template <	pin_id::pin_id		PinID     ,
			mode::mode			Mode      ,
			speed::speed		Speed     ,
			state::state		DefState  ,
			pull::pull			Pull      ,
			flag::flag			Flag      
		>
class gpio_base
{
private:
	class _const_
	{
		friend class gpio_base;
		
		static const stm32::port::address PORT   = stm32::port::convert<PinID>::to_address;
		static const stm32::port::pin     PIN    = stm32::port::convert<PinID>::to_pin;
		
