svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_gpio.hpp
		//static const uint32_t _GPIO_ODR_BB      = FROM_ADDRESS_BIT_POS_TO_BB(&(((GPIO_TypeDef*)PORT)->ODR), PIN);
		//static const uint32_t _GPIO_IDR_BB      = FROM_ADDRESS_BIT_POS_TO_BB(&(((GPIO_TypeDef*)PORT)->IDR), PIN);
		
		static const uint32_t _GPIO_ODR_BB      = PERIPH_BB_BASE + ((uint32_t)PORT - PERIPH_BASE) * 32 + ((uint32_t)&((GPIO_TypeDef*)0)->ODR) * 32 + (PIN) * 4;
		static const uint32_t _GPIO_IDR_BB      = PERIPH_BB_BASE + ((uint32_t)PORT - PERIPH_BASE) * 32 + ((uint32_t)&((GPIO_TypeDef*)0)->IDR) * 32 + (PIN) * 4;
	};
	
protected:
	gpio_base();
	~gpio_base();

public:
	class _cfg_
	{
	public:
		static const pin_id::pin_id			_PinID			= PinID;
		static const stm32::port::address	_Port			= _const_::PORT;
		static const stm32::port::pin		_Pin			= _const_::PIN;
		static const mode::mode				_Mode			= Mode;
		static const speed::speed			_Speed			= Speed;
		static const state::state			_DefPinState	= DefState;
		static const pull::pull				_Pull			= Pull;
		static const flag::flag				_Flag			= Flag;

	private:
		STATIC_ASSERT(FAIL_IF(_PinID != pin_id::invalid && _Port == stm32::port::inv_address), "The MCU has not defined port:pin configuration");
		STATIC_ASSERT(FAIL_IF(_PinID != pin_id::invalid && _Pin  == stm32::port::inv_pin    ), "The MCU has not defined port:pin configuration");

		static const bool verified = config::check_params<_Mode, _Speed, _DefPinState, _Pull, _Flag>::verified;

		typedef stm32::registers::REG_GPIO<_Mode, _Speed, _DefPinState, _Pull, _Flag, _Port, _Pin> REG_GPIO;
		typedef stm32::registers::REG_RCC<_Mode, _PinID> REG_RCC;
	
	public:
		static const uint32_t _cr = REG_GPIO::CR;

		static const uint32_t _odr_mask  = REG_GPIO::ODR_MASK;
		static const uint32_t _odr_val   = REG_GPIO::ODR;
		static const uint32_t _odr_set   = REG_GPIO::ODR_SET;
		static const uint32_t _odr_reset = REG_GPIO::ODR_RESET;

		static const uint32_t _rcc_apb2enr_mask = REG_RCC::APB2ENR_MASK;
		static const uint32_t _rcc_apb2enr      = REG_RCC::APB2ENR;
	};
	
public:
	static void init()
	{
		// Enable peripheral clock
		if(_cfg_::_rcc_apb2enr_mask)
		{
			SET_BIT (RCC->APB2ENR, _cfg_::_rcc_apb2enr);
			__NOP();
		}
		
		update();

		/*--------------------- EXTI Mode Configuration ------------------------*/
		/* Configure the External Interrupt or event for the current IO */
//		if(_cfg_::_Mode == mode::input && (_cfg_::_Flag & flag::flags_input) != 0)
//		{
//			uint32_t temp;
//			
//			/* Enable AFIO Clock */
//			__HAL_RCC_AFIO_CLK_ENABLE();
//			temp = AFIO->EXTICR[_cfg_::_Pin >> 2];
//			CLEAR_BIT(temp, ((uint32_t)0x0F) << (4 * (_cfg_::_Pin & 0x03)));
//			SET_BIT(temp, (GPIO_GET_INDEX(((GPIO_TypeDef*)_cfg_::_Port))) << (4 * (_cfg_::_Pin & 0x03)));
//			AFIO->EXTICR[_cfg_::_Pin >> 2] = temp;


//			/* Configure the interrupt mask */
//			if((_cfg_::_Mode & _const_::GPIO_MODE_IT) == _const_::GPIO_MODE_IT)
//			{
//				SET_BIT(EXTI->IMR, (0x01UL << _cfg_::_Pin)); 
//			} 
//			else
//			{
//				CLEAR_BIT(EXTI->IMR, (0x01UL << _cfg_::_Pin)); 
//			} 

//			/* Configure the event mask */
//			if((_cfg_::_Mode & _const_::GPIO_MODE_EVT) == _const_::GPIO_MODE_EVT)
//			{
//				SET_BIT(EXTI->EMR, (0x01UL << _cfg_::_Pin)); 
//			} 
//			else
//			{
//				CLEAR_BIT(EXTI->EMR, (0x01UL << _cfg_::_Pin)); 
//			}

//			/* Enable or disable the rising trigger */
//			if((_cfg_::_Mode & _const_::RISING_EDGE) == _const_::RISING_EDGE)
//			{
//				SET_BIT(EXTI->RTSR, (0x01UL << _cfg_::_Pin)); 
//			} 
//			else
//			{
//				CLEAR_BIT(EXTI->RTSR, (0x01UL << _cfg_::_Pin)); 
//			}

//			/* Enable or disable the falling trigger */
//			if((_cfg_::_Mode & _const_::FALLING_EDGE) == _const_::FALLING_EDGE)
//			{
//				SET_BIT(EXTI->FTSR, (0x01UL << _cfg_::_Pin)); 
//			} 
//			else
//			{
//				CLEAR_BIT(EXTI->FTSR, (0x01UL << _cfg_::_Pin)); 
//			}
//		}
	}
	
	static void update()
	{
		// Update ODR (pu/pd for input; state for output)
		(_cfg_::_odr_mask) ?
			(
				(_cfg_::_odr_val) ?
					(void)(((GPIO_TypeDef*)_cfg_::_Port)->BSRR = _cfg_::_odr_mask) :
					(void)(((GPIO_TypeDef*)_cfg_::_Port)->BRR  = _cfg_::_odr_mask)
			) :
			(void)(0);

		// configure port
		(_cfg_::_Pin < stm32::port::pin_8) ?
			(void)(MODIFY_REG(((GPIO_TypeDef*)_cfg_::_Port)->CRL,
						((GPIO_CRL_MODE0 | GPIO_CRL_CNF0) << ((_cfg_::_Pin - 0) << 2)),
						(_cfg_::_cr << ((_cfg_::_Pin - 0) << 2)))) :
			(void)(MODIFY_REG(((GPIO_TypeDef*)_cfg_::_Port)->CRH,
						((GPIO_CRL_MODE0 | GPIO_CRL_CNF0) << ((_cfg_::_Pin - 8) << 2)),
						(_cfg_::_cr << ((_cfg_::_Pin - 8) << 2))));
	}
	
	static bool get()
	{
		// accessible at any time
		return IS_BB_REG_SET(_const_::_GPIO_IDR_BB);
	}
	static bool get_out()
	{
		STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode");
		return IS_BB_REG_SET(_const_::_GPIO_ODR_BB);
	}
	static void set()
	{
		STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode");
		SET_BB_REG(_const_::_GPIO_ODR_BB);
	}
	static void reset()
	{
		STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode");
		RESET_BB_REG(_const_::_GPIO_ODR_BB);
	}

	static void write(bool val)
	{
		STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode");
		WRITE_BB_REG(_const_::_GPIO_ODR_BB, val);
	}
	static bool read()
	{
		// accessible at any time
		return IS_BB_REG_SET(_const_::_GPIO_IDR_BB);
	}
	
	template <state::state NewState>
	class _write_ : public gpio_base<_cfg_::_PinID, _cfg_::_Mode, _cfg_::_Speed, NewState    , _cfg_::_Pull, _cfg_::_Flag>
	{ STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode"); };
	
	class _set_   : public gpio_base<_cfg_::_PinID, _cfg_::_Mode, _cfg_::_Speed, state::set  , _cfg_::_Pull, _cfg_::_Flag>
	{ STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode"); };
	
	class _reset_ : public gpio_base<_cfg_::_PinID, _cfg_::_Mode, _cfg_::_Speed, state::reset, _cfg_::_Pull, _cfg_::_Flag>
	{ STATIC_ASSERT(_cfg_::_Mode == mode::output, "Accessible in OUTPUT mode"); };
};

/************************************************************************/
/*                                                                      */
/************************************************************************/
template <	pin_id::pin_id		PinID
		>
class analog : public gpio_base<PinID, mode::analog, speed::low, state::reset, pull::no, flag::flag_no> { };

