svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_gpio.hpp
/************************************************************************/
/*                                                                      */
/************************************************************************/
template <	pin_id::pin_id		PinID,
			pull::pull			Pull      = pull::no
		>
class input : public gpio_base<PinID, mode::input, speed::low, state::reset, Pull, flag::flag_no> { };

/************************************************************************/
/*                                                                      */
/************************************************************************/
template <	pin_id::pin_id		PinID,
			state::state		DefState  = state::reset,
			speed::speed		Speed     = speed::low,
			bool				OpenDrain = false
		>
class output : public gpio_base<PinID, mode::output, Speed, DefState, pull::no, OpenDrain ? flag::output_open_drain : flag::output_push_pull> { };

/************************************************************************/
/*                                                                      */
/************************************************************************/
template <	pin_id::pin_id		PinID,
			pull::pull			Pull      = pull::no
		>
class alt_input : public gpio_base<PinID, mode::alt_input, speed::low, state::reset, Pull, flag::flag_no> { };

/************************************************************************/
/*                                                                      */
/************************************************************************/
template <	pin_id::pin_id		PinID,
			speed::speed		Speed     = speed::low,
			bool				OpenDrain = false
		>
class alt_output : public gpio_base<PinID, mode::alt_output, Speed, state::reset, pull::no, OpenDrain ? flag::alt_output_open_drain : flag::alt_output_push_pull> { };

/************************************************************************/
/*                                                                      */
/************************************************************************/
class gpio_dummy
{
public:
	class _cfg_
	{
	public:
		static const pin_id::pin_id			_PinID			= pin_id::invalid;
		static const stm32::port::address	_Port			= stm32::port::inv_address;
		static const stm32::port::pin		_Pin			= stm32::port::inv_pin;
		static const mode::mode				_Mode			= mode::analog;
		static const speed::speed			_Speed			= speed::low;
		static const state::state			_DefPinState	= state::reset;
		static const pull::pull				_Pull			= pull::no;
		static const flag::flag				_Flag			= flag::flag_no;

		static const uint32_t _cr = 0;
	
		static const uint32_t _odr_mask		= 0;
		static const uint32_t _odr_val		= 0;
		static const uint32_t _odr_set		= 0;
		static const uint32_t _odr_reset	= 0;
	
		static const uint32_t _rcc_apb2enr_mask	= 0;
		static const uint32_t _rcc_apb2enr		= 0;
	};
};

/************************************************************************/
/*                                                                      */
/************************************************************************/
template <class p00, class p01, class p02, class p03, class p04, class p05, class p06, class p07,
		  class p08, class p09, class p10, class p11, class p12, class p13, class p14, class p15,
		  class p16, class p17, class p18, class p19, class p20, class p21, class p22, class p23,
		  class p24, class p25, class p26, class p27, class p28, class p29, class p30, class p31,
		  class p32, class p33, class p34, class p35, class p36, class p37, class p38, class p39>
class atomic
{
#define ASSEMBLE_EXP(exp, ...)				__ASSEM_##exp##(p00, __VA_ARGS__) __ASSEM_##exp##(p01, __VA_ARGS__) \
											__ASSEM_##exp##(p02, __VA_ARGS__) __ASSEM_##exp##(p03, __VA_ARGS__) \
											__ASSEM_##exp##(p04, __VA_ARGS__) __ASSEM_##exp##(p05, __VA_ARGS__) \
											__ASSEM_##exp##(p06, __VA_ARGS__) __ASSEM_##exp##(p07, __VA_ARGS__) \
											__ASSEM_##exp##(p08, __VA_ARGS__) __ASSEM_##exp##(p09, __VA_ARGS__) \
											__ASSEM_##exp##(p10, __VA_ARGS__) __ASSEM_##exp##(p11, __VA_ARGS__) \
											__ASSEM_##exp##(p12, __VA_ARGS__) __ASSEM_##exp##(p13, __VA_ARGS__) \
											__ASSEM_##exp##(p14, __VA_ARGS__) __ASSEM_##exp##(p15, __VA_ARGS__) \
											__ASSEM_##exp##(p16, __VA_ARGS__) __ASSEM_##exp##(p17, __VA_ARGS__) \
											__ASSEM_##exp##(p18, __VA_ARGS__) __ASSEM_##exp##(p19, __VA_ARGS__) \
											__ASSEM_##exp##(p20, __VA_ARGS__) __ASSEM_##exp##(p21, __VA_ARGS__) \
											__ASSEM_##exp##(p22, __VA_ARGS__) __ASSEM_##exp##(p23, __VA_ARGS__) \
											__ASSEM_##exp##(p24, __VA_ARGS__) __ASSEM_##exp##(p25, __VA_ARGS__) \
											__ASSEM_##exp##(p26, __VA_ARGS__) __ASSEM_##exp##(p27, __VA_ARGS__) \
											__ASSEM_##exp##(p28, __VA_ARGS__) __ASSEM_##exp##(p29, __VA_ARGS__) \
											__ASSEM_##exp##(p30, __VA_ARGS__) __ASSEM_##exp##(p31, __VA_ARGS__) \
											__ASSEM_##exp##(p32, __VA_ARGS__) __ASSEM_##exp##(p33, __VA_ARGS__) \
											__ASSEM_##exp##(p34, __VA_ARGS__) __ASSEM_##exp##(p35, __VA_ARGS__) \
											__ASSEM_##exp##(p36, __VA_ARGS__) __ASSEM_##exp##(p37, __VA_ARGS__) \
											__ASSEM_##exp##(p38, __VA_ARGS__) __ASSEM_##exp##(p39, __VA_ARGS__) \

#	define __ASSEM_ALL(type, member)		(type::member) |
#define ASSEMBLE_ALL(member)				(ASSEMBLE_EXP(ALL, member) 0)

#	define __ASSEM_IF(type, port, member)	(port == type::_cfg_::_Port ? type::member : 0) |
#define ASSEMBLE_IF(port, member)			(ASSEMBLE_EXP(IF, port, member) 0)
	
#	define __ASSEM_CRL_MASK(type, p)		((p == type::_cfg_::_Port && type::_cfg_::_Pin < stm32::port::pin_8) ? ((GPIO_CRL_MODE0 | GPIO_CRL_CNF0) << ((type::_cfg_::_Pin - 0) << 2)) : 0) |
#define ASSEMBLE_CRL_MASK(port)				(ASSEMBLE_EXP(CRL_MASK, port) 0)

#	define __ASSEM_CRL(type, p)				((p == type::_cfg_::_Port && type::_cfg_::_Pin < stm32::port::pin_8) ? (type::_cfg_::_cr << ((type::_cfg_::_Pin - 0) << 2)) : 0) |
#define ASSEMBLE_CRL(port)					(ASSEMBLE_EXP(CRL, port) 0)

#	define __ASSEM_CRH_MASK(type, p)		((p == type::_cfg_::_Port && type::_cfg_::_Pin >= stm32::port::pin_8) ? ((GPIO_CRH_MODE8 | GPIO_CRH_CNF8) << ((type::_cfg_::_Pin - 8) << 2)) : 0) |
#define ASSEMBLE_CRH_MASK(port)				(ASSEMBLE_EXP(CRH_MASK, port) 0)

#	define __ASSEM_CRH(type, p)				((p == type::_cfg_::_Port && type::_cfg_::_Pin >= stm32::port::pin_8) ? (type::_cfg_::_cr << ((type::_cfg_::_Pin - 8) << 2)) : 0) |
#define ASSEMBLE_CRH(port)					(ASSEMBLE_EXP(CRH, port) 0)

