svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_gpio.hpp
public:
	static void init()
	{
		static const uint32_t apb2enr_mask = ASSEMBLE_ALL(_cfg_::_rcc_apb2enr_mask);
		static const uint32_t apb2enr = ASSEMBLE_ALL(_cfg_::_rcc_apb2enr);

		// enable GPIO clock
		if(apb2enr_mask)
		{
			SET_BIT(RCC->APB2ENR, apb2enr);
			__NOP();
		}
		
#define __INIT_PORT(PORT)		\
		do { \
			static const uint32_t odr_mask = ASSEMBLE_IF(stm32::port::PORT, _cfg_::_odr_mask); \
			static const uint32_t odr_val  = odr_mask & ASSEMBLE_ALL(_cfg_::_odr_val); \
			static const uint32_t crl_mask = ASSEMBLE_CRL_MASK(stm32::port::PORT); \
			static const uint32_t crl_val  = crl_mask & ASSEMBLE_CRL(stm32::port::PORT); \
			static const uint32_t crh_mask = ASSEMBLE_CRH_MASK(stm32::port::PORT); \
			static const uint32_t crh_val  = crh_mask & ASSEMBLE_CRH(stm32::port::PORT); \
			\
			if(odr_mask) /* initialize Output state */ \
				MODIFY_REG(GPIO##PORT->ODR, odr_mask, odr_val); \
			if(crl_mask) /* initialize mode */ \
				MODIFY_REG(GPIO##PORT->CRL, crl_mask, crl_val); \
			if(crh_mask) /* initialize mode */ \
				MODIFY_REG(GPIO##PORT->CRH, crh_mask, crh_val); \
			/* TODO: EXTI Mode Configuration */ \
		} while(0)

		IF_GPIOA_EXISTS(__INIT_PORT(A);)
		IF_GPIOB_EXISTS(__INIT_PORT(B);)
		IF_GPIOC_EXISTS(__INIT_PORT(C);)
		IF_GPIOD_EXISTS(__INIT_PORT(D);)
		IF_GPIOE_EXISTS(__INIT_PORT(E);)
		IF_GPIOF_EXISTS(__INIT_PORT(F);)
		IF_GPIOG_EXISTS(__INIT_PORT(G);)
		IF_GPIOH_EXISTS(__INIT_PORT(H);)
		IF_GPIOI_EXISTS(__INIT_PORT(I);)
#undef __INIT_PORT

	}
	
	static void update()
	{
#define __UPDATE_PORT(PORT)		\
		do { \
			static const uint32_t odr_mask = ASSEMBLE_IF(stm32::port::PORT, _cfg_::_odr_mask); \
			static const uint32_t odr_val  = odr_mask & ASSEMBLE_ALL(_cfg_::_odr_val); \
			static const uint32_t crl_mask = ASSEMBLE_CRL_MASK(stm32::port::PORT); \
			static const uint32_t crl_val  = crl_mask & ASSEMBLE_CRL(stm32::port::PORT); \
			static const uint32_t crh_mask = ASSEMBLE_CRH_MASK(stm32::port::PORT); \
			static const uint32_t crh_val  = crh_mask & ASSEMBLE_CRH(stm32::port::PORT); \
			\
			if(odr_mask) /* initialize Output state */ \
				MODIFY_REG(GPIO##PORT->ODR, odr_mask, odr_val); \
			if(crl_mask) /* initialize mode */ \
				MODIFY_REG(GPIO##PORT->CRL, crl_mask, crl_val); \
			if(crh_mask) /* initialize mode */ \
				MODIFY_REG(GPIO##PORT->CRH, crh_mask, crh_val); \
		} while(0)

		IF_GPIOA_EXISTS(__UPDATE_PORT(A);)
		IF_GPIOB_EXISTS(__UPDATE_PORT(B);)
		IF_GPIOC_EXISTS(__UPDATE_PORT(C);)
		IF_GPIOD_EXISTS(__UPDATE_PORT(D);)
		IF_GPIOE_EXISTS(__UPDATE_PORT(E);)
		IF_GPIOF_EXISTS(__UPDATE_PORT(F);)
		IF_GPIOG_EXISTS(__UPDATE_PORT(G);)
		IF_GPIOH_EXISTS(__UPDATE_PORT(H);)
		IF_GPIOI_EXISTS(__UPDATE_PORT(I);)
#undef __UPDATE_PORT

	}

	static void write()
	{
#define __WRITE_PORT(PORT)		\
		do { \
			static const uint32_t odr_mask = ASSEMBLE_IF(stm32::port::PORT, _cfg_::_odr_mask); \
			static const uint32_t odr_val  = odr_mask & ASSEMBLE_ALL(_cfg_::_odr_val); \
			\
			if(odr_mask) /* initialize Output state */ \
				MODIFY_REG(GPIO##PORT->ODR, odr_mask, odr_val); \
		} while(0)

		IF_GPIOA_EXISTS(__WRITE_PORT(A);)
		IF_GPIOB_EXISTS(__WRITE_PORT(B);)
		IF_GPIOC_EXISTS(__WRITE_PORT(C);)
		IF_GPIOD_EXISTS(__WRITE_PORT(D);)
		IF_GPIOE_EXISTS(__WRITE_PORT(E);)
		IF_GPIOF_EXISTS(__WRITE_PORT(F);)
		IF_GPIOG_EXISTS(__WRITE_PORT(G);)
		IF_GPIOH_EXISTS(__WRITE_PORT(H);)
		IF_GPIOI_EXISTS(__WRITE_PORT(I);)
#undef __WRITE_PORT

	}

	static void set()
	{
#define __SET_PORT(PORT)		\
		do { \
			static const uint32_t odr_mask = ASSEMBLE_IF(stm32::port::PORT, _cfg_::_odr_mask); \
			/*static const uint32_t odr_set  = odr_mask & ASSEMBLE_ALL(_cfg_::_odr_set);*/ \
			\
			if(odr_mask) \
				WRITE_REG(GPIO##PORT->BSRR, odr_mask); \
		} while(0)

		IF_GPIOA_EXISTS(__SET_PORT(A);)
		IF_GPIOB_EXISTS(__SET_PORT(B);)
		IF_GPIOC_EXISTS(__SET_PORT(C);)
		IF_GPIOD_EXISTS(__SET_PORT(D);)
		IF_GPIOE_EXISTS(__SET_PORT(E);)
		IF_GPIOF_EXISTS(__SET_PORT(F);)
		IF_GPIOG_EXISTS(__SET_PORT(G);)
		IF_GPIOH_EXISTS(__SET_PORT(H);)
		IF_GPIOI_EXISTS(__SET_PORT(I);)
#undef __SET_PORT

	}

	static void reset()
	{
#define __RESET_PORT(PORT)		\
		do { \
			static const uint32_t odr_mask = ASSEMBLE_IF(stm32::port::PORT, _cfg_::_odr_mask); \
			/*static const uint32_t odr_reset  = odr_mask & ASSEMBLE_ALL(_cfg_::_odr_reset);*/ \
			\
			if(odr_mask) \
				WRITE_REG(GPIO##PORT->BRR, odr_mask); \
		} while(0)

		IF_GPIOA_EXISTS(__RESET_PORT(A);)
		IF_GPIOB_EXISTS(__RESET_PORT(B);)
		IF_GPIOC_EXISTS(__RESET_PORT(C);)
		IF_GPIOD_EXISTS(__RESET_PORT(D);)
		IF_GPIOE_EXISTS(__RESET_PORT(E);)
		IF_GPIOF_EXISTS(__RESET_PORT(F);)
		IF_GPIOG_EXISTS(__RESET_PORT(G);)
		IF_GPIOH_EXISTS(__RESET_PORT(H);)
		IF_GPIOI_EXISTS(__RESET_PORT(I);)
#undef __RESET_PORT

	}
};

} // namespace gpio
} // namespace mcu
//////////////////////////////////////////////////////////////////////////
#endif /*__stm32f1xx_gpio_hpp__*/
